xtoolbox/TeenyUSB/driver_stm32/tusb_dev_drv_stm32_fs.c
/* 
 *         _______                    _    _  _____ ____  
 *        |__   __|                  | |  | |/ ____|  _ \ 
 *           | | ___  ___ _ __  _   _| |  | | (___ | |_) |
 *           | |/ _ \/ _ \ '_ \| | | | |  | |\___ \|  _ < 
 *           | |  __/  __/ | | | |_| | |__| |____) | |_) |
 *           |_|\___|\___|_| |_|\__, |\____/|_____/|____/ 
 *                               __/ |                    
 *                              |___/                     
 *
 * TeenyUSB - light weight usb stack for micro controllers
 * 
 * Copyright (c) 2020 XToolBox - admin@xtoolbox.org
 * www.tusb.org
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

/**
 * TeenyUSB device driver need implement these functions:
 * 
 * tusb_dev_drv_open
 * tusb_dev_drv_close
 * tusb_dev_drv_setup_endpoint
 * tusb_dev_drv_get_context
 * tusb_dev_drv_get_speed
 * tusb_dev_drv_set_address
 * tusb_dev_drv_send_data
 * tusb_dev_drv_cancel_send
 * tusb_dev_drv_set_stall
 * tusb_dev_drv_clear_stall
 * tusb_dev_drv_set_recv_buffer
 * tusb_dev_drv_set_rx_valid
 * 
 * TeenyUSB device driver need call these functions:
 * 
 * tusb_device_ep_xfer_done
 * tusb_device_reset
 * 
 */

#include "teeny_usb_device.h"
#include "teeny_usb_device_driver.h"
#include "teeny_usb_util.h"
#include "teeny_usb_def.h"
#include "tusb_platform_stm32.h"
#include "tusb_dev_drv_stm32_fs.h"
#include "string.h"

#ifdef USB

#ifndef PMA_SIZE
#define PMA_SIZE 512
#endif

#ifndef STM32_MAX_EP_COUNT
#define STM32_MAX_EP_COUNT 8
#endif

void tusb_delay_ms(uint32_t ms);

// IN/OUT structure for endpoint
typedef struct _tusb_ep_data
{
    const uint8_t *tx_buf;           /**< data transmit buffer for IN endpoint */
    uint8_t *rx_buf;                 /**< data receive buffer for OUT endpoint */
    int32_t  tx_remain_size;         /**< data reamin size in transmit buffer */
    int32_t  tx_total_size;          /**< total transmit data length */
    int32_t  rx_size;                /**< data buffer total size in receive buffer */
    int32_t  rx_count;               /**< current received data length */
    uint16_t tx_last_size;           /**< last transmit data length */
    uint16_t tx_need_zlp : 1;        /**< need transmit zero length packet */
    uint16_t bit_field_padding : 7;  /**< padding to 16 bit boundary */
    uint16_t tx_pushed : 8;          /**< data packet number in the PMA buffer */
} tusb_ep_data;

struct _tusb_device_driver
{
    void *context;
    tusb_ep_data Ep[STM32_MAX_EP_COUNT];
    uint16_t mps_in[STM32_MAX_EP_COUNT];
    uint16_t mps_out[STM32_MAX_EP_COUNT];
};

#define GetInMaxPacket(drv, EPn) ((drv)->mps_in[(EPn)])
#define GetOutMaxPacket(drv, EPn) ((drv)->mps_out[(EPn)])

// STM32 FS device driver instance
static tusb_device_driver_t stm32_dev_drv;

#define IMR_MSK ((USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM))

#ifndef USB_CLR_DIR
#define USB_CLR_DIR ((uint16_t)~USB_ISTR_DIR)
#endif
#ifndef USB_CLR_ESOF
#define USB_CLR_ESOF ((uint16_t)~USB_ISTR_ESOF)
#endif
#ifndef USB_CLR_SOF
#define USB_CLR_SOF ((uint16_t)~USB_ISTR_SOF)
#endif
#ifndef USB_CLR_RESET
#define USB_CLR_RESET ((uint16_t)~USB_ISTR_RESET)
#endif
#ifndef USB_CLR_SUSP
#define USB_CLR_SUSP ((uint16_t)~USB_ISTR_SUSP)
#endif
#ifndef USB_CLR_WKUP
#define USB_CLR_WKUP ((uint16_t)~USB_ISTR_WKUP)
#endif
#ifndef USB_CLR_ERR
#define USB_CLR_ERR ((uint16_t)~USB_ISTR_ERR)
#endif
#ifndef USB_CLR_PMAOVR
#define USB_CLR_PMAOVR ((uint16_t)~USB_ISTR_PMAOVR)
#endif
#ifndef USB_CLR_CTR
#define USB_CLR_CTR ((uint16_t)~USB_ISTR_CTR)
#endif

#if defined(STM32F3)
#define AFL(val, pin) ((val) << (((pin)) * 4))
#define AFH(val, pin) ((val) << (((pin)-8) * 4))
static void set_io_af_mode(GPIO_TypeDef *GPIO, uint8_t pin, uint8_t af)
{
    GPIO->MODER &= ~(GPIO_MODER_MODER0 << (pin * 2));
    GPIO->MODER |= (GPIO_MODER_MODER0_1 << (pin * 2));
    GPIO->OTYPER &= ~(GPIO_OTYPER_OT_0 << pin);
    GPIO->OSPEEDR |= ((GPIO_OSPEEDER_OSPEEDR0_0 | GPIO_OSPEEDER_OSPEEDR0_1) << (pin * 2));
    if (pin > 7)
    {
        GPIO->AFR[1] &= ~(AFH(0xf, pin));
        GPIO->AFR[1] |= (AFH(af, pin));
    }
    else
    {
        GPIO->AFR[0] &= ~(AFL(0xf, pin));
        GPIO->AFR[0] |= (AFL(af, pin));
    }
}
#endif

static void tusb_disconnect(tusb_device_driver_t *dev)
{
#if defined(STM32F0)
//#ifdef USB_FS_INTERNAL_PULLUP
    if(GetUSB(drv)->BCDR & USB_BCDR_DPPU){
        RCC->APB1ENR |= RCC_APB1ENR_USBEN;
        GetUSB(dev)->BCDR &= ~USB_BCDR_DPPU;
    }else{
        RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
        // PA12 = PushPull = 0
        GPIOA->OTYPER |= GPIO_OTYPER_OT_12;
        GPIOA->MODER &= ~GPIO_MODER_MODER12;
        GPIOA->MODER |= GPIO_MODER_MODER12_0;
        GPIOA->OSPEEDR |= GPIO_OSPEEDR_OSPEEDR12;
        GPIOA->BRR = GPIO_BRR_BR_12;
    }
#endif

#if defined(STM32F1)
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    // PA_12 output mode: OD = 0
    GPIOA->CRH |= GPIO_CRH_CNF12_0;
    GPIOA->CRH &= (~GPIO_CRH_CNF12_1);
    GPIOA->CRH |= GPIO_CRH_MODE12; // PA_12 set as: Output mode, max speed 50 MHz.
    GPIOA->BRR = GPIO_BRR_BR12;
#endif

#if defined(STM32F3)
    RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
    GPIOA->MODER &= ~GPIO_MODER_MODER12;
    GPIOA->MODER |= GPIO_MODER_MODER12_0;
    GPIOA->BRR = GPIO_BRR_BR_12;
#endif
}

int tusb_dev_drv_open(tusb_device_driver_t **pdrv, const tusb_hardware_param_t *param, void *context)
{
    tusb_device_driver_t * drv = &stm32_dev_drv;
    if (!pdrv){
        return -1;
    }
    drv->context = context;
    *pdrv = drv;

    tusb_disconnect(drv);

    tusb_delay_ms(20);

