xtoolbox/TeenyUSB/driver_stm32/tusb_dev_drv_stm32_fs.c
#if defined(STM32F0)
    if(IS_HSI_CLOCK(param)){
        RCC->CFGR3 &= ~RCC_CFGR3_USBSW;
        RCC->APB1ENR |= RCC_APB1ENR_CRSEN;
        CRS->CFGR &= ~CRS_CFGR_SYNCSRC;
        CRS->CFGR |= RCC_CRS_SYNC_SOURCE_USB;
        CRS->CR |= (CRS_CR_AUTOTRIMEN | CRS_CR_CEN);
    }else{
        RCC->CFGR3 |= RCC_CFGR3_USBSW_PLLCLK;
    }
#else
    if(IS_HSI_CLOCK(param)){
        TUSB_LOGD("HSI clock is not support on this device\n");
    }
    if(IS_INTERNAL_PULLUP(param)){
        TUSB_LOGD("Interanl pullup is not support on this device\n");
    }
#endif

    RCC->APB1ENR |= RCC_APB1ENR_USBEN;

    GetUSB(drv)->CNTR = (USB_CNTR_FRES);
    GetUSB(drv)->CNTR = (0);

    // wait reset finish
    while (!((GetUSB(drv)->ISTR) & USB_ISTR_RESET))
        ;

    GetUSB(drv)->ISTR = (0);
    GetUSB(drv)->BTABLE = (BTABLE_ADDRESS);
    GetUSB(drv)->CNTR = (IMR_MSK);

#if defined(STM32F0)
    if(IS_INTERNAL_PULLUP(param)){
        // USE the interal pull up resistor
        GetUSB(drv)->BCDR |= USB_BCDR_DPPU;
    }else{
        RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
        // PA12 = In float
        GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR12;
        GPIOA->MODER &= ~GPIO_MODER_MODER12;
    }
    NVIC_EnableIRQ(USB_IRQn);
#endif

#if defined(STM32F1)
    // PA12 = Input
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    GPIOA->CRH |= GPIO_CRH_CNF12_0;
    GPIOA->CRH &= ~GPIO_CRH_CNF12_1;
    GPIOA->CRH &= ~GPIO_CRH_MODE12;
    NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
#endif

#if defined(STM32F3)
    // PA12 = Input
    RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
    set_io_af_mode(GPIOA, 11, GPIO_AF14_USB);
    set_io_af_mode(GPIOA, 12, GPIO_AF14_USB);
    NVIC_EnableIRQ(USB_LP_CAN_RX0_IRQn);
#endif
    return 0;
}

static inline void enable_double_buffer_interrupt()
{
#if defined(STM32F1)
    NVIC_EnableIRQ(USB_HP_CAN1_TX_IRQn);
#endif
#if defined(STM32F3)
    NVIC_EnableIRQ(USB_HP_CAN_TX_IRQn);
#endif
}

void *tusb_dev_drv_get_context(tusb_device_driver_t *drv)
{
    return drv->context;
}

int tusb_dev_drv_close(tusb_device_driver_t *drv)
{
#if defined(STM32F0)
    NVIC_DisableIRQ(USB_IRQn);
#endif

#if defined(STM32F1)
    NVIC_DisableIRQ(USB_HP_CAN1_TX_IRQn);
    NVIC_DisableIRQ(USB_LP_CAN1_RX0_IRQn);
#endif

#if defined(STM32F3)
    NVIC_DisableIRQ(USB_HP_CAN_TX_IRQn);
    NVIC_DisableIRQ(USB_LP_CAN_RX0_IRQn);
#endif

    GetUSB(drv)->ISTR = (0);
    // Turn USB Macrocell off (FRES + PWDN)
    GetUSB(drv)->CNTR = (USB_CNTR_FRES | USB_CNTR_PDWN);

    tusb_disconnect(drv);

    // Disable USB Clock on APB1
    RCC->APB1ENR &= ~RCC_APB1ENR_USBEN;

    TUSB_LOGD("Close STM32 FS device\n");
    return 0;
}

#ifndef USB_CNTR_LP_MODE
#define USB_CNTR_LP_MODE USB_CNTR_LPMODE
#endif
static void tsub_suspend(tusb_device_driver_t *drv)
{
    uint16_t wCNTR;

    wCNTR = GetUSB(drv)->CNTR;
    wCNTR |= USB_CNTR_FSUSP;
    GetUSB(drv)->CNTR = (wCNTR);

    wCNTR = GetUSB(drv)->CNTR;
    wCNTR |= USB_CNTR_LP_MODE;
    GetUSB(drv)->CNTR = (wCNTR);
}

void tsub_resume(tusb_device_driver_t *drv)
{
    uint16_t wCNTR;
    wCNTR = GetUSB(drv)->CNTR;
    wCNTR &= (~USB_CNTR_LP_MODE);
    GetUSB(drv)->CNTR = (wCNTR);
    GetUSB(drv)->CNTR = (IMR_MSK);
}

// end point data handler, also called in USB_HP IRQ
void tusb_ep_handler(tusb_device_driver_t *drv, uint8_t EPn);

#if defined(STM32F3)
void USB_HP_CAN_TX_IRQHandler(void)
#else
void USB_HP_CAN1_TX_IRQHandler(void)
#endif
{
    uint16_t wIstr;
#ifdef  RTOS_INTERRUPT_ENTER
    RTOS_INTERRUPT_ENTER();
#endif
    tusb_device_driver_t *drv = &stm32_dev_drv;
    while ((wIstr = GetUSB(drv)->ISTR) & USB_ISTR_CTR)
    {
        GetUSB(drv)->ISTR = (uint16_t)(USB_CLR_CTR);
        tusb_ep_handler(drv, wIstr & USB_ISTR_EP_ID);
    }
#ifdef  RTOS_INTERRUPT_LEAVE
    RTOS_INTERRUPT_LEAVE();
#endif
}

#if defined(STM32F0)
void USB_IRQHandler(void)
#elif defined(STM32F3)
void USB_LP_CAN_RX0_IRQHandler(void)
#else
void USB_LP_CAN1_RX0_IRQHandler(void)
#endif
{
    tusb_device_driver_t *drv = &stm32_dev_drv;
    uint16_t wIstr;
#ifdef  RTOS_INTERRUPT_ENTER
    RTOS_INTERRUPT_ENTER();
#endif
    while ((wIstr = GetUSB(drv)->ISTR) & USB_ISTR_CTR)
    {
        GetUSB(drv)->ISTR = (uint16_t)(USB_CLR_CTR);
        tusb_ep_handler(drv, wIstr & USB_ISTR_EP_ID);
    }

    if (wIstr & USB_ISTR_RESET)
    {
        GetUSB(drv)->ISTR = (USB_CLR_RESET);
        GetUSB(drv)->BTABLE = (BTABLE_ADDRESS);
        tusb_device_reset(drv);
        GetUSB(drv)->DADDR = (0 | USB_DADDR_EF);
    }
    if (IMR_MSK & USB_ISTR_PMAOVR)
    {
        if (wIstr & USB_ISTR_PMAOVR)
        {
            GetUSB(drv)->ISTR = (USB_CLR_PMAOVR);
        }
    }
    if (IMR_MSK & USB_ISTR_SUSP)
    {
        if (wIstr & USB_ISTR_SUSP)
        {
            GetUSB(drv)->ISTR = (USB_CLR_SUSP);
            if (GetUSB(drv)->DADDR & 0x007f)
            {
                GetUSB(drv)->DADDR = (0);
                GetUSB(drv)->CNTR &= ~USB_CNTR_SUSPM;
            }
            tsub_suspend(drv);
        }
    }
    if (IMR_MSK & USB_ISTR_ERR)
    {
        if (wIstr & USB_ISTR_ERR)
        {
            GetUSB(drv)->ISTR = (USB_CLR_ERR);
        }
    }

    if (IMR_MSK & USB_ISTR_WKUP)
    {
        if (wIstr & USB_ISTR_WKUP)
        {
            GetUSB(drv)->ISTR = (USB_CLR_WKUP);
            tsub_resume(drv);
        }
    }

    if (IMR_MSK & USB_ISTR_SOF)
    {
        if (wIstr & USB_ISTR_SOF)
        {
            GetUSB(drv)->ISTR = (USB_CLR_SOF);
        }
    }
    if (IMR_MSK & USB_ISTR_ESOF)
    {
        if (wIstr & USB_ISTR_ESOF)
        {
            GetUSB(drv)->ISTR = (USB_CLR_ESOF);
        }
    }

    GetUSB(drv)->ISTR = (0);
#ifdef  RTOS_INTERRUPT_LEAVE
    RTOS_INTERRUPT_LEAVE();
#endif
}

int tusb_dev_drv_setup_endpoint(tusb_device_driver_t *drv, const tusb_ep_config *ep_config, int count, int is_reset)
{    
    uint8_t ep_in[TUSB_MAX_EP_PAIR_COUNT] = {0};
    uint8_t ep_out[TUSB_MAX_EP_PAIR_COUNT] = {0};
    uint32_t used = 0;
    uint32_t used_double = 0;
    uint8_t max_ep_id = 0;
    for (int i = 0; i < count; i++)
    {
        // first calculate the buffer requirement, for both double buffer and single buffer
        const tusb_ep_config *cfg = ep_config + i;
        uint8_t ep = cfg->addr & 0x7f;
        uint8_t type = cfg->attribute & 3;
        if (ep >= STM32_MAX_EP_COUNT)
        {
            TUSB_LOGE("Endpoint 0x%02x large than STM32 max ep\n", cfg->addr);
            continue;
        }
        if (ep > max_ep_id)
        {
            max_ep_id = ep;
        }
        if (cfg->addr & 0x80)
        {
            if (ep_in[ep])
            {
                TUSB_LOGW("Endpoint 0x%02x already used, ignore it\n", cfg->addr);
                continue;
            }
            drv->mps_in[ep] = cfg->mps;
            ep_in[ep] = 1;
        }
        else
        {
            if (ep_out[ep])
            {
                TUSB_LOGW("Endpoint 0x%02x already used, ignore it\n", cfg->addr);
                continue;
            }
            drv->mps_out[ep] = cfg->mps;
            ep_out[ep] = 1;
        }
        if (type == USBD_EP_TYPE_ISOC)
        {
            // ISO must use double buffer
            used += cfg->mps * 2;
            used_double += cfg->mps * 2;
            if (cfg->addr & 0x80)
            {
                if (ep_out[ep])
                {
                    TUSB_LOGE("STM32 FS ISO EP 0x%02x already used by out direction\n", cfg->addr);
                }
            }
            else
            {
                if (ep_in[ep])
                {
                    TUSB_LOGE("STM32 FS ISO EP 0x%02x already used by in direction\n", cfg->addr);
                }
            }
        }
        else if (type == USBD_EP_TYPE_BULK)
        {
            used += cfg->mps;
            used_double += cfg->mps * 2;
            if (cfg->addr & 0x80)
            {
                if (ep_out[ep])
                {
                    TUSB_LOGD("Other out direction used, disable double buffer mode\n");
                    if (used_double < PMA_SIZE)
                    {
                        used_double = PMA_SIZE + 1;
                    }
                }
            }
            else
            {
                if (ep_in[ep])
                {
                    TUSB_LOGD("Other in direction used, disable double buffer mode\n");
                    if (used_double < PMA_SIZE)
                    {
                        used_double = PMA_SIZE + 1;
                    }
                }
            }
        }
        else
        {
            used += cfg->mps;
            used_double += cfg->mps;
        }
    }
    // reserved space for endpoint config
    uint32_t bt_start = (max_ep_id + 1) * 8;
    uint8_t real_double = 0;
    if (bt_start + used_double <= PMA_SIZE)
    {
        // used double buffer mode
        if (used != used_double)
        {
            // real has double buffer endpoint
            TUSB_LOGD("Double buffer for bulk endpoint enabled\n");
            real_double = 1;
            enable_double_buffer_interrupt();
        }
    }
    else if (bt_start + used <= PMA_SIZE)
    {
        // use single buffer mode
    }
    else
    {
        TUSB_LOGE("Endpoint PMA buffer overflow, some ep will not init\n");
    }
    uint8_t ep_in_used[TUSB_MAX_EP_PAIR_COUNT] = {0};
    uint8_t ep_out_used[TUSB_MAX_EP_PAIR_COUNT] = {0};
    for (int i = 0; i < count; i++)
    {
        const tusb_ep_config *cfg = ep_config + i;
        uint8_t ep = cfg->addr & 0x7f;
        uint8_t type = cfg->attribute & 3;
        uint16_t s_type = 0;
        switch(type){
            case USBD_EP_TYPE_CTRL: s_type = USB_EP_CONTROL; break;
            case USBD_EP_TYPE_BULK: s_type = USB_EP_BULK; break;
            case USBD_EP_TYPE_ISOC: s_type = USB_EP_ISOCHRONOUS; break;
            case USBD_EP_TYPE_INTR: s_type = USB_EP_INTERRUPT; break;
        }
        if (ep >= STM32_MAX_EP_COUNT)
        {
            TUSB_LOGE("Endpoint 0x%02x large than STM32 max ep\n", cfg->addr);
            continue;
        }
        if (((type == USBD_EP_TYPE_BULK) && real_double) || (type == USBD_EP_TYPE_ISOC))
        {
            if (cfg->addr & 0x80)
            {
                if (!ep_in_used[ep])
                {
                    ep_in_used[ep] = 1;
                    INIT_EP_TxDouble(drv, ep, s_type);
                    SET_DBL_TX_CNT(drv, ep, 0);
                    SET_DOUBLE_ADDR(drv, ep, bt_start, bt_start + cfg->mps);
                    TUSB_LOGD("EP: 0x%02x, addr0: 0x%x addr1:0x%x, size: %d, Double Tx, Type 0x%x\n",
                              cfg->addr, (int)bt_start, (int)(bt_start + cfg->mps), cfg->mps, s_type);
                    bt_start += cfg->mps * 2;
                }
                else
                {
                    TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                }
            }
            else
            {
                if (!ep_out_used[ep])
                {
                    ep_out_used[ep] = 1;
                    INIT_EP_RxDouble(drv, ep, s_type);
                    SET_DBL_RX_CNT(drv, ep, cfg->mps);
                    SET_DOUBLE_ADDR(drv, ep, bt_start, bt_start + cfg->mps);
                    TUSB_LOGD("EP: 0x%02x, addr0: 0x%x addr1:0x%x, size: %d, Double Rx, Type 0x%x\n",
                              cfg->addr, (int)bt_start, (int)(bt_start + cfg->mps), cfg->mps, s_type);
                    bt_start += cfg->mps * 2;
                }
                else
                {
                    TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                }
            }
        }
        else
        {
            if (ep_in[ep] && ep_out[ep])
            {
                if (cfg->addr & 0x80)
                {
                    if (!ep_in_used[ep])
                    {
                        ep_in_used[ep] = 1;
                        if(!ep_out_used[ep]){
                            TUSB_LOGD("INIT Bi-Direction Ep %d, type 0x%x\n", ep ,s_type);
                            INIT_EP_BiDirection(drv, ep, s_type);
                        }
                        SET_TX_ADDR(drv, ep, bt_start);
                        TUSB_LOGD("EP: 0x%02x, addr: 0x%x, size: %d, Bi-Direction Tx, Type 0x%x\n", cfg->addr, (int)bt_start, cfg->mps, s_type);
                        bt_start += cfg->mps;
                    }
                    else
                    {
                        TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                    }
                }
                else
                {
                    if (!ep_out_used[ep])
                    {
                        ep_out_used[ep] = 1;
                        if(!ep_in_used[ep]){
                            TUSB_LOGD("INIT Bi-Direction Ep %d, type 0x%x\n", ep ,s_type);
                            INIT_EP_BiDirection(drv, ep, s_type);
                        }
                        SET_RX_ADDR(drv, ep, bt_start);
                        SET_RX_CNT(drv, ep, cfg->mps);
                        TUSB_LOGD("EP: 0x%02x, addr: 0x%x, size: %d, Bi-Direction Rx, Type 0x%x\n", cfg->addr, (int)bt_start, cfg->mps, s_type);
                        bt_start += cfg->mps;
                    }
                    else
                    {
                        TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                    }
                }
            }
            else
            {
                if (cfg->addr & 0x80)
                {
                    if (!ep_in_used[ep])
                    {
                        ep_in_used[ep] = 1;
                        INIT_EP_TxOnly(drv, ep, s_type);
                        SET_TX_ADDR(drv, ep, bt_start);
                        TUSB_LOGD("EP: 0x%02x, addr: 0x%x, size: %d, Tx Only, Type 0x%x\n", cfg->addr, (int)bt_start, cfg->mps, s_type);
                        bt_start += cfg->mps;
                    }
                    else
                    {
                        TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                    }
                }
                else
                {
                    if (!ep_out_used[ep])
                    {
                        ep_out_used[ep] = 1;
                        INIT_EP_RxOnly(drv, ep, s_type);
                        SET_RX_ADDR(drv, ep, bt_start);
                        SET_RX_CNT(drv, ep, cfg->mps);
                        TUSB_LOGD("EP: 0x%02x, addr: 0x%x, size: %d, Rx Only, Type 0x%x\n", cfg->addr, (int)bt_start, cfg->mps, s_type);
                        bt_start += cfg->mps;
                    }
                    else
                    {
                        TUSB_LOGW("Ignore duplicate EP: 0x%02x\n", cfg->addr);
                    }
                }
            }
        }
    }
    return 0;
}

int tusb_dev_drv_get_speed(tusb_device_driver_t *drv)
{
    return PORT_SPEED_FULL;
}

int tusb_dev_drv_set_address(tusb_device_driver_t *drv, uint8_t addr, uint8_t after_status_out)
{
    if (after_status_out)
    {
        // FS device must set address after status out
        if (addr)
        {
            GetUSB(drv)->DADDR = (addr | USB_DADDR_EF);
        }
    }
    return 0;
}

// Copy data to PMA buffer, if memory is aligned, copy two by two
static void tusb_pma_tx(tusb_device_driver_t *drv, pma_record *pma, const void *data, uint32_t len)
{
    uint32_t count = (len + 1) / 2;
    pma_data *dest = GetPMAAddr(drv, pma->addr);
    pma->cnt = len;
#ifdef ALIGNED
    const uint16_t *src = (const uint16_t *)data;
    for (uint8_t i = 0; i < count; i++)
    {
        dest->data = *src;
        dest++;
        src++;
    }
#else
    const uint8_t *src = (const uint8_t *)data;
    for (uint8_t i = 0; i < count; i++)
    {
        uint16_t v = src[0] | (src[1] << 8);
        src += 2;
        dest->data = v;
        dest++;
    }
#endif
}

// Copy data from PMA buffer, if memory is aligned, copy two by two
static uint32_t tusb_pma_rx(tusb_device_driver_t *drv, pma_record *pma, void *data)
{
    uint32_t len = pma->cnt;
    pma_data *src = GetPMAAddr(drv, pma->addr);
    uint32_t count = (len + 1) / 2;
#ifdef ALIGNED
    uint16_t *dest = (uint16_t *)data;
    for (uint32_t i = 0; i < count; i++)
    {
        *dest = src->data;
        dest++;
        src++;
    }
#else
    uint8_t *dest = (uint8_t *)data;
    for (uint32_t i = 0; i < count; i++)
    {
        uint16_t v = src->data;
        *dest = (uint8_t)v;
        dest++;
        v >>= 8;
        *dest = (uint8_t)v;
        dest++;
        src++;
    }
#endif
    return len;
}

