xtoolbox/TeenyUSB/driver_stm32/tusb_dev_drv_stm32_fs.c
// helper function to copy data to end point
static void copy_tx(tusb_device_driver_t *drv, tusb_ep_data *ep, pma_record *pma, const void *data, int len, uint16_t tx_max_size)
{
    ep->tx_remain_size = len;
    ep->tx_buf = (const uint8_t *)data;
    if (len > tx_max_size)
    {
        len = tx_max_size;
    }
    tusb_pma_tx(drv, pma, data, len);
    ep->tx_pushed++;
    ep->tx_buf += len;
    ep->tx_remain_size -= len;
    ep->tx_last_size = len;
}

#define DOUBLE_BUFF 1
#define ISO_EP 1

int tusb_dev_drv_send_data(tusb_device_driver_t *drv, uint8_t EPn, const void *data, int len, uint8_t option)
{
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    tusb_ep_data *ep = &drv->Ep[EPn];
    ep->tx_total_size = len;
    ep->tx_need_zlp = (option & TUSB_TXF_ZLP) != 0;
    if (ep->tx_remain_size)
        return -1;
    if (DOUBLE_BUFF && (EP & (USB_EP_TYPE_MASK | USB_EP_KIND)) == (USB_EP_BULK | USB_EP_KIND))
    {
        // double buffer ep send data
        pma_record *pma0;
        pma_record *pma1;
        uint16_t TOG = (EP & (USB_EP_DTOG_RX | USB_EP_DTOG_TX));
        if (TOG != 0 && TOG != (USB_EP_DTOG_RX | USB_EP_DTOG_TX))
        {
            return -1;
        }
        ep->tx_pushed = 0;
        if (EP & USB_EP_DTOG_RX)
        {
            pma0 = PMA_TX1(drv, EPn);
            pma1 = PMA_TX0(drv, EPn);
        }
        else
        {
            pma0 = PMA_TX0(drv, EPn);
            pma1 = PMA_TX1(drv, EPn);
        }
        copy_tx(drv, ep, pma0, data, len, GetInMaxPacket(drv, EPn));
        if (ep->tx_remain_size)
        {
            copy_tx(drv, ep, pma1, ep->tx_buf, ep->tx_remain_size, GetInMaxPacket(drv, EPn));
        }
        // toggle it
        TUSB_RX_DTOG(GetUSB(drv), EPn, EP);
    }
    else if (ISO_EP && ((EP & USB_EP_TYPE_MASK) == USB_EP_ISOCHRONOUS))
    {
        pma_record *pma = EP & USB_EP_DTOG_TX ? PMA_TX0(drv, EPn) : PMA_TX1(drv, EPn);
        ep->tx_pushed = 0;
        copy_tx(drv, ep, pma, data, len, GetInMaxPacket(drv, EPn));
        // ISO endpoint don't neet set valid, only need set the tx size
        // TUSB_SET_TX_STATUS(GetUSB(drv), EPn, EP, USB_EP_TX_VALID);
    }
    else
    {
        // normal ep send data
        if ((EP & USB_EPTX_STAT) != USB_EP_TX_NAK)
        {
            return -1;
        }
        ep->tx_pushed = 0;
        copy_tx(drv, ep, PMA_TX(drv, EPn), data, len, GetInMaxPacket(drv, EPn));
        TUSB_SET_TX_STATUS(GetUSB(drv), EPn, EP, USB_EP_TX_VALID);
    }
    return 0;
}

// called by the ep data interrupt handler when last packet tranfer done
static void tusb_send_data_done(tusb_device_driver_t *drv, uint8_t EPn)
{
    tusb_ep_data *ep = &drv->Ep[EPn];
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    pma_record *pma;

#define IS_DOUBLE() (DOUBLE_BUFF && (EP & (USB_EP_TYPE_MASK | USB_EP_KIND)) == (USB_EP_BULK | USB_EP_KIND))
#define IS_ISO() (ISO_EP && ((EP & USB_EP_TYPE_MASK) == USB_EP_ISOCHRONOUS))

    if (IS_DOUBLE())
    {
        // double buffer bulk end point, toggle first then copy data
        if (ep->tx_pushed)
        {
            ep->tx_pushed--;
        }
        if (ep->tx_pushed)
        {
            // toggle it first, then do some copy
            TUSB_RX_DTOG(GetUSB(drv), EPn, EP);
        }
        pma = (EP & USB_EP_DTOG_RX) ? PMA_TX0(drv, EPn) : PMA_TX1(drv, EPn);
    }
    else if (IS_ISO())
    {
        ep->tx_pushed = 0;
        pma = (EP & USB_EP_DTOG_TX) ? PMA_TX0(drv, EPn) : PMA_TX1(drv, EPn);
        pma->cnt = 0;
    }
    else
    {
        ep->tx_pushed = 0;
        pma = PMA_TX(drv, EPn);
    }
    if (ep->tx_remain_size || ((ep->tx_need_zlp) && ep->tx_last_size == GetInMaxPacket(drv, EPn)))
    {
        copy_tx(drv, ep, pma, ep->tx_buf, ep->tx_remain_size, GetInMaxPacket(drv, EPn));
        PCD_SET_EP_TX_STATUS(GetUSB(drv), EPn, USB_EP_TX_VALID);
        return;
    }
    if (ep->tx_pushed == 0)
    {
        if (IS_ISO())
        {
            if (ep->tx_buf)
            {
                int len = ep->tx_total_size - ep->tx_remain_size;
                tusb_device_ep_xfer_done(drv, EPn | 0x80, ep->tx_buf - len, len, 0);
                ep->tx_buf = 0;
            }
        }
        else
        {
            int len = ep->tx_total_size - ep->tx_remain_size;
            tusb_device_ep_xfer_done(drv, EPn | 0x80, ep->tx_buf - len, len, 0);
        }
    }
}

int tusb_dev_drv_cancel_send(tusb_device_driver_t *drv, uint8_t EPn)
{
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    tusb_ep_data *ep = &drv->Ep[EPn];
    int res = ep->tx_remain_size;
    ep->tx_remain_size = 0;
    if (DOUBLE_BUFF && (EP & (USB_EP_TYPE_MASK | USB_EP_KIND)) == (USB_EP_BULK | USB_EP_KIND))
    {
        uint16_t TOG = (EP & (USB_EP_DTOG_RX | USB_EP_DTOG_TX));
        if (TOG != 0 && TOG != (USB_EP_DTOG_RX | USB_EP_DTOG_TX))
        {
            // make sure toogle bit is the same, so the ep will enter nak mode
            TUSB_RX_DTOG(GetUSB(drv), EPn, EP);
        }
    }
    else if (ISO_EP && ((EP & USB_EP_TYPE_MASK) == USB_EP_ISOCHRONOUS))
    {
        // just the count to zero
        PMA_TX0(drv, EPn)->cnt = 0;
        PMA_TX1(drv, EPn)->cnt = 0;
    }
    else
    {
        // normal ep send data
        if ((EP & USB_EPTX_STAT) != USB_EP_TX_NAK)
        {
            TUSB_SET_TX_STATUS(GetUSB(drv), EPn, EP, USB_EP_TX_NAK);
        }
    }
    return res;
}

void tusb_dev_drv_set_stall(tusb_device_driver_t *drv, uint8_t EPn)
{
    uint8_t ep = EPn & 0x7f;
    if (ep == 0)
    {
        //PCD_SET_EP_TXRX_STATUS(GetUSB(dev), 0, USB_EP_RX_STALL, USB_EP_TX_STALL);
        PCD_SET_EP_TX_STATUS(GetUSB(drv), 0, USB_EP_TX_STALL);
        // We should prepare endpoint 0 to receive setup packet
        // But the setup packet always success receive, so do nothing here
    }
    else
    {
        if (EPn & 0x80)
        {
            PCD_SET_EP_TX_STATUS(GetUSB(drv), ep, USB_EP_TX_STALL);
        }
        else
        {
            PCD_SET_EP_RX_STATUS(GetUSB(drv), ep, USB_EP_RX_STALL);
        }
    }
}

void tusb_dev_drv_clear_stall(tusb_device_driver_t *drv, uint8_t EPn)
{
    uint8_t ep = EPn & 0x7f;
    if (ep == 0)
    {
        PCD_CLEAR_TX_DTOG(GetUSB(drv), 0);
        //PCD_SET_EP_TX_STATUS(GetUSB(drv), 0, USB_EP_TX_VALID);
        PCD_CLEAR_RX_DTOG(GetUSB(drv), 0);
        PCD_SET_EP_RX_STATUS(GetUSB(drv), 0, USB_EP_RX_VALID);
    }
    else
    {
        if (EPn & 0x80)
        {
            PCD_CLEAR_TX_DTOG(GetUSB(drv), ep);
            PCD_SET_EP_TX_STATUS(GetUSB(drv), ep, USB_EP_TX_NAK);
        }
        else
        {
            PCD_CLEAR_RX_DTOG(GetUSB(drv), ep);
            PCD_SET_EP_RX_STATUS(GetUSB(drv), ep, USB_EP_RX_VALID);
        }
    }
}

// helper function to read ep0
uint32_t tusb_read_ep0(tusb_device_driver_t *drv, void *buf)
{
    return tusb_pma_rx(drv, PMA_RX(drv, 0), buf);
}

// called by the ep data interrupt handler when got data
void tusb_recv_data(tusb_device_driver_t *drv, uint8_t EPn)
{
    tusb_ep_data *ep = &drv->Ep[EPn];
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    pma_record *pma = 0;
    if (DOUBLE_BUFF && (EP & (USB_EP_TYPE_MASK | USB_EP_KIND)) == (USB_EP_BULK | USB_EP_KIND))
    {
        // double buffer bulk end point
        // If rx count is not valid, freeze the DTOG, this will cause ep NAK
        if (ep->rx_count < ep->rx_size)
        {
            TUSB_TX_DTOG(GetUSB(drv), EPn, EP);
            // If App last used buffer is 1, drv will fill data in 0
            // If App last used buffer is 0, drv will fill data in 1
            // We read the data filled by device
            pma = (EP & USB_EP_DTOG_TX) ? PMA_RX0(drv, EPn) : PMA_RX1(drv, EPn);
        }
    }
    else if (ISO_EP && ((EP & USB_EP_TYPE_MASK) == USB_EP_ISOCHRONOUS))
    {
        // ISO out endpoint will always receive the new packet
        // if rx count is not valid, current packet in PMA buffer will be dropped
        if (ep->rx_count < ep->rx_size)
        {
            pma = (EP & USB_EP_DTOG_RX) ? PMA_TX0(drv, EPn) : PMA_TX1(drv, EPn);
        }
    }
    else
    {
        pma = PMA_RX(drv, EPn);
    }
    if (ep->rx_buf && pma)
    {
        uint32_t len = tusb_pma_rx(drv, pma, ep->rx_buf + ep->rx_count);
        pma->cnt = 0;
        ep->rx_count += len;
        if (len != GetOutMaxPacket(drv, EPn) || ep->rx_count >= ep->rx_size)
        {
            if (tusb_device_ep_xfer_done(drv, EPn, ep->rx_buf, ep->rx_count, 0) == 0)
            {
                ep->rx_count = 0;
            }
            else
            {
                // of rx done not return success, change rx_count to rx_size, this will block
                // the data recieve
                ep->rx_count = ep->rx_size;
            }
        }
    }
    if (ep->rx_count < ep->rx_size)
    {
        TUSB_SET_RX_STATUS(GetUSB(drv), EPn, EP, USB_EP_RX_VALID);
    }
}

// initial the ep recv buffer
int tusb_dev_drv_set_recv_buffer(tusb_device_driver_t *drv, uint8_t EPn, void *data, int len)
{
    tusb_ep_data *ep = &drv->Ep[EPn];
    ep->rx_buf = (uint8_t *)data;
    ep->rx_size = len;
    ep->rx_count = 0;
    return 0;
}

void tusb_dev_drv_set_rx_valid(tusb_device_driver_t *drv, uint8_t EPn)
{
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    tusb_ep_data *ep = &drv->Ep[EPn];
    ep->rx_count = 0;
    if (DOUBLE_BUFF && (EP & (USB_EP_TYPE_MASK | USB_EP_KIND)) == (USB_EP_BULK | USB_EP_KIND))
    {
        // Rx inital for double buffer ep
        uint16_t TOG = (EP & (USB_EP_DTOG_RX | USB_EP_DTOG_TX));
        pma_record *pma = 0;
        pma = (EP & USB_EP_DTOG_TX) ? PMA_RX0(drv, EPn) : PMA_RX1(drv, EPn);
        // got the pma buffer last used by the USB core
        if (pma->cnt)
        {
            // already has data in the pma buffer, copy it to the rx buffer
            uint32_t len = tusb_pma_rx(drv, pma, ep->rx_buf + ep->rx_count);
            pma->cnt = 0;
            ep->rx_count += len;
            if (len != GetOutMaxPacket(drv, EPn) || ep->rx_count >= ep->rx_size)
            {
                if (tusb_device_ep_xfer_done(drv, EPn, ep->rx_buf, ep->rx_count, 0) == 0)
                {
                    ep->rx_count = 0;
                }
                else
                {
                    ep->rx_count = ep->rx_size;
                }
            }
        }
        if (TOG == 0 || TOG == (USB_EP_DTOG_RX | USB_EP_DTOG_TX))
        {
            // always enter here
            TUSB_TX_DTOG(GetUSB(drv), EPn, EP);
        }
    }
    else
    {
        // Rx initial for normal ep
        TUSB_SET_RX_STATUS(GetUSB(drv), EPn, EP, USB_EP_RX_VALID);
    }
}

// end point handler for USB_FS core
void tusb_ep_handler(tusb_device_driver_t *drv, uint8_t EPn)
{
    uint16_t EP = PCD_GET_ENDPOINT(GetUSB(drv), EPn);
    if (EP & USB_EP_CTR_RX)
    {
        if (EPn == 0)
        {
            if (EP & USB_EP_SETUP)
            {
                // Handle setup packet
                uint8_t temp[8];
                tusb_read_ep0(drv, temp);
                tusb_device_ep_xfer_done(drv, EPn, temp, 8, 1);
            }
            else
            {
                // Handle ep 0 data packet
                tusb_recv_data(drv, EPn);
            }
            TUSB_CLEAR_RX_CTR(GetUSB(drv), PCD_ENDP0, EP);
            TUSB_SET_RX_STATUS(GetUSB(drv), PCD_ENDP0, EP, USB_EP_RX_VALID);
        }
        else
        {
            TUSB_CLEAR_RX_CTR(GetUSB(drv), EPn, EP);
            tusb_recv_data(drv, EPn);
        }
    }
    if ((EP & USB_EP_CTR_TX))
    { // something transmitted
        TUSB_CLEAR_TX_CTR(GetUSB(drv), EPn, EP);
        tusb_send_data_done(drv, EPn);
    }
}

#endif // #ifdef USB
